eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws. 
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO 
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer 
 *
 * Copyright (C) 2013(2020) Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_sci_iic_private.h
 * Description  : Functions for using SCI_IIC on RX devices. 
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.07.2013 1.00     First Release
 *         : 30.09.2013 1.10     Change symbol of return value and status
 *         : 01.07.2014 1.20     RX110 support added.
 *         : 22.09.2014 1.30     RX64M support added.
 *         : 01.12.2014 1.40     RX113 support added.
 *         : 15.12.2014 1.50     RX71M support added.
 *         : 27.02.2015 1.60     RX63N support added.
 *         : 29.05.2015 1.70     RX231 support added.
 *         : 31.10.2015 1.80     RX130, RX230, RX23T support added.
 *         : 04.03.2016 1.90     RX24T support added.Changed about the pin definitions.
 *         : 31.08.2017 2.20     Added parameter check of Configuration Options.
 *                               Added macro definition SCI_IIC_PRV_PCR_BASE_REG, SCI_IIC_PRV_PDR_BASE_REG,
 *                                SCI_IIC_PRV_PMR_BASE_REG, SCI_IIC_PRV_ODR0_BASE_REG, SCI_IIC_PRV_ODR1_BASE_REG,
 *                                SCI_IIC_PRV_PFS_BASE_REG and SCI_IIC_PRV_PIDR_BASE_REG.
 *         : 26.10.2017 2.30     RX66T support added.
 *                               Port K is added.
 *         : 21.09.2018 2.40     RX72T support added.
 *         : 20.05.2019 2.41     Added support for GNUC and ICCRX.
 *                               Fixed coding style.
 *         : 20.06.2019 2.42     RX23W support added.
 *         : 30.07.2019 2.43     RX72M support added.
 *         : 30.10.2019 2.44     RX13T support added.
 *         : 22.11.2019 2.45     RX66N, RX72N support added.
 *         : 10.03.2020 2.46     RX23E-A support added.
 **********************************************************************************************************************/
/* Guards against multiple inclusion */
#ifndef SCI_IIC_PRIVATE_H
    #define SCI_IIC_PRIVATE_H
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Fixed width integer support. */
    #include <stdint.h>
/* bool support */
    #include <stdbool.h>

    #include "r_sci_iic_rx_if.h"
    #include "r_sci_iic_rx_pin_config.h"
    #include "r_sci_iic_rx_config.h"

/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/
/*============================================================================*/
/*  Parameter check of Pin Configuration Options                              */
/*============================================================================*/
/* SCI_IIC port (ascii to number) */
/* SCI0 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI0_SSCL0_PORT) && (('9') >= R_SCI_IIC_CFG_SCI0_SSCL0_PORT))
        #define SCI_IIC_CFG_CH0_SSCL_GP (R_SCI_IIC_CFG_SCI0_SSCL0_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI0_SSCL0_PORT) && (('H') >= R_SCI_IIC_CFG_SCI0_SSCL0_PORT))
        #define SCI_IIC_CFG_CH0_SSCL_GP (R_SCI_IIC_CFG_SCI0_SSCL0_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI0_SSCL0_PORT) && (('N') >= R_SCI_IIC_CFG_SCI0_SSCL0_PORT))
        #define SCI_IIC_CFG_CH0_SSCL_GP (R_SCI_IIC_CFG_SCI0_SSCL0_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI0_SSCL0_PORT)
        #define SCI_IIC_CFG_CH0_SSCL_GP (R_SCI_IIC_CFG_SCI0_SSCL0_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI0_SSCL0_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI0_SSCL0_BIT) && (('7') >= R_SCI_IIC_CFG_SCI0_SSCL0_BIT))
        #define SCI_IIC_CFG_CH0_SSCL_PIN    (R_SCI_IIC_CFG_SCI0_SSCL0_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI0_SSCL0_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI0_SSDA0_PORT) && (('9') >= R_SCI_IIC_CFG_SCI0_SSDA0_PORT))
        #define SCI_IIC_CFG_CH0_SSDA_GP (R_SCI_IIC_CFG_SCI0_SSDA0_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI0_SSDA0_PORT) && (('H') >= R_SCI_IIC_CFG_SCI0_SSDA0_PORT))
        #define SCI_IIC_CFG_CH0_SSDA_GP (R_SCI_IIC_CFG_SCI0_SSDA0_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI0_SSDA0_PORT) && (('N') >= R_SCI_IIC_CFG_SCI0_SSDA0_PORT))
        #define SCI_IIC_CFG_CH0_SSDA_GP (R_SCI_IIC_CFG_SCI0_SSDA0_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI0_SSDA0_PORT)
        #define SCI_IIC_CFG_CH0_SSDA_GP (R_SCI_IIC_CFG_SCI0_SSDA0_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI0_SSDA0_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI0_SSDA0_BIT) && (('7') >= R_SCI_IIC_CFG_SCI0_SSDA0_BIT))
        #define SCI_IIC_CFG_CH0_SSDA_PIN    (R_SCI_IIC_CFG_SCI0_SSDA0_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI0_SSDA0_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI1 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI1_SSCL1_PORT) && (('9') >= R_SCI_IIC_CFG_SCI1_SSCL1_PORT))
        #define SCI_IIC_CFG_CH1_SSCL_GP (R_SCI_IIC_CFG_SCI1_SSCL1_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI1_SSCL1_PORT) && (('H') >= R_SCI_IIC_CFG_SCI1_SSCL1_PORT))
        #define SCI_IIC_CFG_CH1_SSCL_GP (R_SCI_IIC_CFG_SCI1_SSCL1_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI1_SSCL1_PORT) && (('N') >= R_SCI_IIC_CFG_SCI1_SSCL1_PORT))
        #define SCI_IIC_CFG_CH1_SSCL_GP (R_SCI_IIC_CFG_SCI1_SSCL1_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI1_SSCL1_PORT)
        #define SCI_IIC_CFG_CH1_SSCL_GP (R_SCI_IIC_CFG_SCI1_SSCL1_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI1_SSCL1_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI1_SSCL1_BIT) && (('7') >= R_SCI_IIC_CFG_SCI1_SSCL1_BIT))
        #define SCI_IIC_CFG_CH1_SSCL_PIN    (R_SCI_IIC_CFG_SCI1_SSCL1_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI1_SSCL1_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI1_SSDA1_PORT) && (('9') >= R_SCI_IIC_CFG_SCI1_SSDA1_PORT))
        #define SCI_IIC_CFG_CH1_SSDA_GP (R_SCI_IIC_CFG_SCI1_SSDA1_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI1_SSDA1_PORT) && (('H') >= R_SCI_IIC_CFG_SCI1_SSDA1_PORT))
        #define SCI_IIC_CFG_CH1_SSDA_GP (R_SCI_IIC_CFG_SCI1_SSDA1_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI1_SSDA1_PORT) && (('N') >= R_SCI_IIC_CFG_SCI1_SSDA1_PORT))
        #define SCI_IIC_CFG_CH1_SSDA_GP (R_SCI_IIC_CFG_SCI1_SSDA1_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI1_SSDA1_PORT)
        #define SCI_IIC_CFG_CH1_SSDA_GP (R_SCI_IIC_CFG_SCI1_SSDA1_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI1_SSDA1_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI1_SSDA1_BIT) && (('7') >= R_SCI_IIC_CFG_SCI1_SSDA1_BIT))
        #define SCI_IIC_CFG_CH1_SSDA_PIN    (R_SCI_IIC_CFG_SCI1_SSDA1_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI1_SSDA1_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI2 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI2_SSCL2_PORT) && (('9') >= R_SCI_IIC_CFG_SCI2_SSCL2_PORT))
        #define SCI_IIC_CFG_CH2_SSCL_GP (R_SCI_IIC_CFG_SCI2_SSCL2_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI2_SSCL2_PORT) && (('H') >= R_SCI_IIC_CFG_SCI2_SSCL2_PORT))
        #define SCI_IIC_CFG_CH2_SSCL_GP (R_SCI_IIC_CFG_SCI2_SSCL2_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI2_SSCL2_PORT) && (('N') >= R_SCI_IIC_CFG_SCI2_SSCL2_PORT))
        #define SCI_IIC_CFG_CH2_SSCL_GP (R_SCI_IIC_CFG_SCI2_SSCL2_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI2_SSCL2_PORT)
        #define SCI_IIC_CFG_CH2_SSCL_GP (R_SCI_IIC_CFG_SCI2_SSCL2_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI2_SSCL2_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI2_SSCL2_BIT) && (('7') >= R_SCI_IIC_CFG_SCI2_SSCL2_BIT))
        #define SCI_IIC_CFG_CH2_SSCL_PIN    (R_SCI_IIC_CFG_SCI2_SSCL2_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI2_SSCL2_BIT in r_sci_iic_rx_pin_config.h"
    #endif

