eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/* SCI6 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI6_SSCL6_PORT) && (('9') >= R_SCI_IIC_CFG_SCI6_SSCL6_PORT))
        #define SCI_IIC_CFG_CH6_SSCL_GP (R_SCI_IIC_CFG_SCI6_SSCL6_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI6_SSCL6_PORT) && (('H') >= R_SCI_IIC_CFG_SCI6_SSCL6_PORT))
        #define SCI_IIC_CFG_CH6_SSCL_GP (R_SCI_IIC_CFG_SCI6_SSCL6_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI6_SSCL6_PORT) && (('N') >= R_SCI_IIC_CFG_SCI6_SSCL6_PORT))
        #define SCI_IIC_CFG_CH6_SSCL_GP (R_SCI_IIC_CFG_SCI6_SSCL6_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI6_SSCL6_PORT)
        #define SCI_IIC_CFG_CH6_SSCL_GP (R_SCI_IIC_CFG_SCI6_SSCL6_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI6_SSCL6_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI6_SSCL6_BIT) && (('7') >= R_SCI_IIC_CFG_SCI6_SSCL6_BIT))
        #define SCI_IIC_CFG_CH6_SSCL_PIN    (R_SCI_IIC_CFG_SCI6_SSCL6_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI6_SSCL6_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI6_SSDA6_PORT) && (('9') >= R_SCI_IIC_CFG_SCI6_SSDA6_PORT))
        #define SCI_IIC_CFG_CH6_SSDA_GP (R_SCI_IIC_CFG_SCI6_SSDA6_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI6_SSDA6_PORT) && (('H') >= R_SCI_IIC_CFG_SCI6_SSDA6_PORT))
        #define SCI_IIC_CFG_CH6_SSDA_GP (R_SCI_IIC_CFG_SCI6_SSDA6_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI6_SSDA6_PORT) && (('N') >= R_SCI_IIC_CFG_SCI6_SSDA6_PORT))
        #define SCI_IIC_CFG_CH6_SSDA_GP (R_SCI_IIC_CFG_SCI6_SSDA6_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI6_SSDA6_PORT)
        #define SCI_IIC_CFG_CH6_SSDA_GP (R_SCI_IIC_CFG_SCI6_SSDA6_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI6_SSDA6_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI6_SSDA6_BIT) && (('7') >= R_SCI_IIC_CFG_SCI6_SSDA6_BIT))
        #define SCI_IIC_CFG_CH6_SSDA_PIN    (R_SCI_IIC_CFG_SCI6_SSDA6_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI6_SSDA6_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI7 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI7_SSCL7_PORT) && (('9') >= R_SCI_IIC_CFG_SCI7_SSCL7_PORT))
        #define SCI_IIC_CFG_CH7_SSCL_GP (R_SCI_IIC_CFG_SCI7_SSCL7_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI7_SSCL7_PORT) && (('H') >= R_SCI_IIC_CFG_SCI7_SSCL7_PORT))
        #define SCI_IIC_CFG_CH7_SSCL_GP (R_SCI_IIC_CFG_SCI7_SSCL7_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI7_SSCL7_PORT) && (('N') >= R_SCI_IIC_CFG_SCI7_SSCL7_PORT))
        #define SCI_IIC_CFG_CH7_SSCL_GP (R_SCI_IIC_CFG_SCI7_SSCL7_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI7_SSCL7_PORT)
        #define SCI_IIC_CFG_CH7_SSCL_GP (R_SCI_IIC_CFG_SCI7_SSCL7_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI7_SSCL7_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI7_SSCL7_BIT) && (('7') >= R_SCI_IIC_CFG_SCI7_SSCL7_BIT))
        #define SCI_IIC_CFG_CH7_SSCL_PIN    (R_SCI_IIC_CFG_SCI7_SSCL7_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI7_SSCL7_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI7_SSDA7_PORT) && (('9') >= R_SCI_IIC_CFG_SCI7_SSDA7_PORT))
        #define SCI_IIC_CFG_CH7_SSDA_GP (R_SCI_IIC_CFG_SCI7_SSDA7_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI7_SSDA7_PORT) && (('H') >= R_SCI_IIC_CFG_SCI7_SSDA7_PORT))
        #define SCI_IIC_CFG_CH7_SSDA_GP (R_SCI_IIC_CFG_SCI7_SSDA7_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI7_SSDA7_PORT) && (('N') >= R_SCI_IIC_CFG_SCI7_SSDA7_PORT))
        #define SCI_IIC_CFG_CH7_SSDA_GP (R_SCI_IIC_CFG_SCI7_SSDA7_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI7_SSDA7_PORT)
        #define SCI_IIC_CFG_CH7_SSDA_GP (R_SCI_IIC_CFG_SCI7_SSDA7_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI7_SSDA7_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI7_SSDA7_BIT) && (('7') >= R_SCI_IIC_CFG_SCI7_SSDA7_BIT))
        #define SCI_IIC_CFG_CH7_SSDA_PIN    (R_SCI_IIC_CFG_SCI7_SSDA7_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI7_SSDA7_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI8 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI8_SSCL8_PORT) && (('9') >= R_SCI_IIC_CFG_SCI8_SSCL8_PORT))
        #define SCI_IIC_CFG_CH8_SSCL_GP (R_SCI_IIC_CFG_SCI8_SSCL8_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI8_SSCL8_PORT) && (('H') >= R_SCI_IIC_CFG_SCI8_SSCL8_PORT))
        #define SCI_IIC_CFG_CH8_SSCL_GP (R_SCI_IIC_CFG_SCI8_SSCL8_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI8_SSCL8_PORT) && (('N') >= R_SCI_IIC_CFG_SCI8_SSCL8_PORT))
        #define SCI_IIC_CFG_CH8_SSCL_GP (R_SCI_IIC_CFG_SCI8_SSCL8_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI8_SSCL8_PORT)
        #define SCI_IIC_CFG_CH8_SSCL_GP (R_SCI_IIC_CFG_SCI8_SSCL8_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI8_SSCL8_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI8_SSCL8_BIT) && (('7') >= R_SCI_IIC_CFG_SCI8_SSCL8_BIT))
        #define SCI_IIC_CFG_CH8_SSCL_PIN    (R_SCI_IIC_CFG_SCI8_SSCL8_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI8_SSCL8_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI8_SSDA8_PORT) && (('9') >= R_SCI_IIC_CFG_SCI8_SSDA8_PORT))
        #define SCI_IIC_CFG_CH8_SSDA_GP (R_SCI_IIC_CFG_SCI8_SSDA8_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI8_SSDA8_PORT) && (('H') >= R_SCI_IIC_CFG_SCI8_SSDA8_PORT))
        #define SCI_IIC_CFG_CH8_SSDA_GP (R_SCI_IIC_CFG_SCI8_SSDA8_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI8_SSDA8_PORT) && (('N') >= R_SCI_IIC_CFG_SCI8_SSDA8_PORT))
        #define SCI_IIC_CFG_CH8_SSDA_GP (R_SCI_IIC_CFG_SCI8_SSDA8_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI8_SSDA8_PORT)
        #define SCI_IIC_CFG_CH8_SSDA_GP (R_SCI_IIC_CFG_SCI8_SSDA8_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI8_SSDA8_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI8_SSDA8_BIT) && (('7') >= R_SCI_IIC_CFG_SCI8_SSDA8_BIT))
        #define SCI_IIC_CFG_CH8_SSDA_PIN    (R_SCI_IIC_CFG_SCI8_SSDA8_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI8_SSDA8_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI9 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI9_SSCL9_PORT) && (('9') >= R_SCI_IIC_CFG_SCI9_SSCL9_PORT))
        #define SCI_IIC_CFG_CH9_SSCL_GP (R_SCI_IIC_CFG_SCI9_SSCL9_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI9_SSCL9_PORT) && (('H') >= R_SCI_IIC_CFG_SCI9_SSCL9_PORT))
        #define SCI_IIC_CFG_CH9_SSCL_GP (R_SCI_IIC_CFG_SCI9_SSCL9_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI9_SSCL9_PORT) && (('N') >= R_SCI_IIC_CFG_SCI9_SSCL9_PORT))
        #define SCI_IIC_CFG_CH9_SSCL_GP (R_SCI_IIC_CFG_SCI9_SSCL9_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI9_SSCL9_PORT)
        #define SCI_IIC_CFG_CH9_SSCL_GP (R_SCI_IIC_CFG_SCI9_SSCL9_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI9_SSCL9_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI9_SSCL9_BIT) && (('7') >= R_SCI_IIC_CFG_SCI9_SSCL9_BIT))
        #define SCI_IIC_CFG_CH9_SSCL_PIN    (R_SCI_IIC_CFG_SCI9_SSCL9_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI9_SSCL9_BIT in r_sci_iic_rx_pin_config.h"
    #endif

