eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/*============================================================================*/
/*  Parameter check of Configuration Options                                  */
/*============================================================================*/
    #if ((0 != SCI_IIC_CFG_PARAM_CHECKING_ENABLE) && (1 != SCI_IIC_CFG_PARAM_CHECKING_ENABLE))
        #error "ERROR - SCI_IIC_CFG_PARAM_CHECKING_ENABLE - Parameter error in configures file.  "
    #endif

    #if ((0 > SCI_IIC_CFG_BUS_CHECK_COUNTER) || (0xFFFFFFFF < SCI_IIC_CFG_BUS_CHECK_COUNTER))
        #error "ERROR - SCI_IIC_CFG_BUS_CHECK_COUNTER - Parameter error in configures file.  "
    #endif

    #if ((0 != SCI_IIC_CFG_PORT_SETTING_PROCESSING) && (1 != SCI_IIC_CFG_PORT_SETTING_PROCESSING))
        #error "ERROR - SCI_IIC_CFG_PORT_SETTING_PROCESSING - Parameter error in configures file.  "
    #endif

/* check of channel 0 */
    #if (1 == SCI_IIC_CFG_CH0_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH0_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH0_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH0_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH0_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH0_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH0_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH0_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH0_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH0_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH0_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH0_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH0_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH0_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH0_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH0_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH0_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH0_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 1 */
    #if (1 == SCI_IIC_CFG_CH1_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH1_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH1_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH1_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH1_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH1_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH1_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH1_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH1_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH1_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH1_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH1_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH1_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH1_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH1_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH1_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH1_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH1_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 2 */
    #if (1 == SCI_IIC_CFG_CH2_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH2_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH2_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH2_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH2_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH2_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH2_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH2_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH2_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH2_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH2_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH2_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH2_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH2_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH2_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH2_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH2_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH2_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 3 */
    #if (1 == SCI_IIC_CFG_CH3_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH3_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH3_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH3_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH3_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH3_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH3_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH3_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH3_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH3_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH3_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH3_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH3_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH3_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH3_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH3_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH3_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH3_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 4 */
    #if (1 == SCI_IIC_CFG_CH4_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH4_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH4_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH4_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH4_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH4_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH4_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH4_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH4_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH4_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH4_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH4_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH4_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH4_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH4_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH4_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH4_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH4_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 5 */
    #if (1 == SCI_IIC_CFG_CH5_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH5_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH5_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH5_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH5_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH5_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH5_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH5_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH5_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH5_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH5_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH5_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH5_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH5_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH5_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH5_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH5_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH5_INCLUDED - Parameter error in configures file.  "
    #endif

